### 1. 라이브러리 선언

In [27]:
import pandas as pd

In [28]:
import warnings

In [29]:
warnings.filterwarnings(action="ignore")

### 2. 데이터 불러오기

In [30]:
selloutData = pd.read_csv("../dataset/join_kopo_product_volume.csv")

In [31]:
a01Data = selloutData.loc[selloutData.REGIONID == "A01"]
a02Data = selloutData.loc[selloutData.REGIONID == "A02"]

## 3.데이터 예측
### a01 지역은: 통계적 예측, a02 지역은: 머신러닝 예측

In [32]:
a01Data["PREDICT"] = 10

In [33]:
a02Data["PREDICT"] = 30

In [34]:
print(a01Data)
print(a02Data)

  REGIONID PRODUCT  YEARWEEK   QTY  PREDICT
0      A01  ST0001    201901  3000       10
1      A01  ST0001    201902  3500       10
  REGIONID PRODUCT  YEARWEEK   QTY  PREDICT
2      A02  ST0002    201901  4000       30
3      A02  ST0003    201902  7000       30

### 4. 데이터 병합

In [35]:
a01Data.append(a02Data)

  REGIONID PRODUCT  YEARWEEK   QTY  PREDICT
0      A01  ST0001    201901  3000       10
1      A01  ST0001    201902  3500       10
2      A02  ST0002    201901  4000       30
3      A02  ST0003    201902  7000       30

In [38]:
### concat

In [43]:
 pd.concat([a01Data, a02Data], axis=0)

  REGIONID PRODUCT  YEARWEEK   QTY  PREDICT
0      A01  ST0001    201901  3000       10
1      A01  ST0001    201902  3500       10
2      A02  ST0002    201901  4000       30
3      A02  ST0003    201902  7000       30

In [44]:
### 새로운 컬럽 값 병합

In [45]:
st01data = pd.read_csv("../dataset/st0001data.csv")

In [47]:
maxDate = st01data.WEEK.max()
fcstWindow = 1000
columns = st01data.columns
regionid = st01data.loc[0,].REGIONID
productgroup = st01data.loc[0,].PRODUCTGROUP
# 신규 주차 정보 생성
for i in range(0, fcstWindow):
    yearweek = maxDate + i + 1
    volume=0
    indf = pd.DataFrame( [[regionid,productgroup, yearweek, volume] ],
    columns= columns)
    st01data = st01data.append(indf)

In [48]:
st01data

   REGIONID PRODUCTGROUP  WEEK  MEAN_VOLUME
0       A01       ST0001     1       559479
1       A01       ST0001     2       483233
2       A01       ST0001     3       457317
3       A01       ST0001     4       500629
4       A01       ST0001     5       541937
..      ...          ...   ...          ...
0       A01       ST0001  1049            0
0       A01       ST0001  1050            0
0       A01       ST0001  1051            0
0       A01       ST0001  1052            0
0       A01       ST0001  1053            0

[1053 rows x 4 columns]

In [49]:
excelData = pd.read_excel("../dataset/missingValue.xlsx")

In [50]:
excelData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [55]:
excelData.isnull().any()

regionid    False
product     False
week        False
qty         False
target       True
dtype: bool

In [57]:
excelData0fill = excelData.fillna(0)

In [58]:
excelData0fill

  regionid   product  week  qty  target
0        3         3     3  3.0     3.0
1      A01  PRODUCT1     2  2.0     0.0
2        3         3     3  3.0     3.0
3      A01  PRODUCT1     3  4.0     0.0

In [54]:
excelData.loc[excelData.qty.isnull()] = 3

In [56]:
excelData.isnull().sum()

regionid    0
product     0
week        0
qty         0
target      2
dtype: int64